<!DOCTYPE html>
<html>
    <body>
        <?php
        /* ƒадени са температурните стойности:
        78, 60, 62, 68, 71, 68, 73, 85, 66,
        64, 76, 63, 75, 76, 73, 68, 62, 73, 
        72, 65, 74, 62, 62, 65, 64, 68, 73, 
        75, 79, 73
        Ќапишете програма, ко€то извежда следното:
	5-те най-високи стойности;
	5-те най-ниски стойности;
        —редна стойност за периода; */
        
        $temp = [78, 60, 62, 68, 71, 68, 73, 85, 66, 64, 76, 63, 
            75, 76, 73, 68, 62, 73, 72, 65, 74, 62, 65, 64, 68, 
            73, 75, 79, 73];
         echo(max(array(78, 60, 62, 68, 71, 68, 73, 85, 66, 64, 76, 63, 
            75, 76, 73, 68, 62, 73, 72, 65, 74, 62, 65, 64, 68, 
            73, 75, 79, 73)));
         echo '<br />';
         echo (min(array(78, 60, 62, 68, 71, 68, 73, 85, 66, 64, 76, 63, 
            75, 76, 73, 68, 62, 73, 72, 65, 74, 62, 65, 64, 68, 
            73, 75, 79, 73)));
         echo '<br />';
         
         $length = count($temp);
         //echo $length;
         
      
         $sum = array_sum($temp);
         //echo $sum;
         
         
         $average = $sum / $length;
         echo $average;
        
        
        
     
        
        

        
        
        
        ?>
    </body>
</html>